from dataclasses import dataclass

# сущность:
#     МобильныйТелефон
# поля:
#     ИД - целое уникальное число
#     Марка - строка (макс 10 символов)
#     Модель - строка (макс 15 символов)
#     Вес - целое число
#     Диагональ экрана - дробное число
#     Ёмкость аккумултора - целое число
#     Состояние - строка (макс 10 символов)
#     Цена - целое число
#     Количество на складе - целое число


@dataclass
class MobilePhone:
    id: int
    brand: str
    model: str
    weight: int
    screen_diagonal: float
    battery: int
    status: str
    price: int
    amount: int


# действия пользователя в программе

# 1) искать Мобильные телефоны по:
#     ИД
#     Марка
#     Цена
#     Состояние

# 2) сортировать Мобильные телефоны по:
#     ИД
#     Цена
#     Диагональ экрана
#     Ёмкость аккумултора
#     Вес

# 3) добавлять новые мобильные телефоны в список телефонов
def add_phone_to_list()

# 4) удалять мобильные телефоны из списка телефонов

# 5) изменить поле "Количество на складе" в сущности мобильный телефон

# 6) изменить всю информацию о мобильном телефоне, кроме поля ИД, предварительно найдя его по ИД

# 7) вывести список всех мобильных телефонов

# 8) вывести мобильный телефон по ИД

# 9) сохранить список мобильных телефонов в текстовый файл, в двух вариантах
#     для удобного чтения человеком
#     для последующей удобной загрузки компьютером в эту программу (по одному полю на строку)

# 10) загрузить список мобильных телефонов из текстового файла

phones = []
