import random

students = [
    "Деличобан Егор Олегович",
    "Царюков Богдан Алексеевич",
    "Русин Иван Ростиславович",
    "Тараканова Ксения Владимировна",
    "Рождественская Мария Сергеевна",
    "Беликова Ксения Артуровна",
    "Kirill Maklagin",
    "Горбатенко Тимофей Алексеевич",
    "Чекрыгина Екатерина Дмитриевна",
    "Вольпер Леонид Владимирович",
    "Новиков Артём Романович",
    "Мартухович Юрий Семёнович",
    "Глухов Андрей Александрович",
    "Диляра",
    "Ульяна Шевердина Антоновна",
    "Зуйков Евгений Андреевич",
    "Зубарев Тимофей Михайлович",
    "Мещеряков Артëм Константинович",
    "Дубок Алексей Александрович",
    "Арапов Макар Александрович",
    "Синяговский Михаил Дмитриевич",
    "Мартьянов Ильдар Игоревич",
    "Будаев Владислав Дмитриевич",
    "Рубан Альбина Александрович",
    "Флуерарь Лара",
    "Маркина Ханна Сергеевна",
    "Учаев Илья Андреевич",
    "Кенжебаев Далер Фархатович",
]

students_indexs = []
current_index = 0

while len(students_indexs) < 7:
    current_index = random.randint(0, len(students) - 1)

    if current_index not in students_indexs:
        students_indexs.append(current_index)

for i in range(len(students_indexs)):
    current_index = students_indexs[i]

    print(f"{i+1} - {students[current_index]}")
